popp-client/src/main/resources/example/StartCardSession/StartCardSession_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v8="http://ws.gematik.de/conn/CardService/v8.2" xmlns:v2="http://ws.gematik.de/conn/ConnectorContext/v2.0" xmlns:v5="http://ws.gematik.de/conn/ConnectorCommon/v5.0">
   <soapenv:Header/>
   <soapenv:Body>
      <v8:StartCardSession>
         <v2:Context>
            <v5:MandantId>?</v5:MandantId>
            <v5:ClientSystemId>?</v5:ClientSystemId>
            <v5:WorkplaceId>?</v5:WorkplaceId>
            <!--Optional:-->
            <v5:UserId>?</v5:UserId>
         </v2:Context>
         <v5:CardHandle>?</v5:CardHandle>
      </v8:StartCardSession>
   </soapenv:Body>
</soapenv:Envelope>
